; domain
; Guy - ECE final project

(define (domain auto_warehouse)

;; Defining options for the planning system    :adl
(:requirements :adl :typing)

;; Defining types
(:types
  forklift_a forklift_b - agent
  initial pickup dropoff - location
  pallet_a pallet_b - pallet
  pallet agent - physobj
  physobj operation location - object
)

; just dummy for stopping
(:constants
      stop - operation
)

(:predicates
    ;location of a robot or package. Either initial, pickup or dropoff
    (at ?obj - physobj ?loc - location)
    ;is a certain pallet on a certain robot?
    (on ?pkg - pallet ?robot - agent)
    ;can we use this forklift or this package
    (avail ?obj - physobj )
  )

;just moves the robot between places
(:action move
    :parameters (?robot - agent ?from - location ?to - location)
    :precondition (at ?robot ?from)
    :effect (and (at ?robot ?to) (not (at ?robot ?from)))
)

;pickup a pallet if robot is at the location of the pallet and it's capacity
;is allowing 
(:action load
    :parameters (?robot - agent ?unit - pallet ?loc - pickup)
    :precondition (and (avail ?robot) (avail ?unit)
                       (at ?robot ?loc) (at ?unit ?loc ) )
    :effect (and (not (avail ?unit)) (not (avail ?robot))
                 (on ?unit ?robot) (not (at ?unit ?loc )) )
  )

(:action unload
    :parameters   (?robot - agent ?unit - pallet ?loc - dropoff)
    :precondition (and (at ?robot ?loc) (on ?unit ?robot) )
    :effect       (and (not (on ?unit ?robot)) (at ?unit ?loc) (avail ?robot) )
  )

)

; problem
(define (problem auto_warehouse_easy)
  (:domain auto_warehouse)
  (:objects
    p1 p2 p3 - pallet
    robot1 robot2 - agent
    x1 x2 - initial 
    Loc1 Loc2 Loc3 - pickup
    Loc4 Loc5 Loc6 - dropoff
  )
  (:init (at p1 Loc1) (at p2 Loc2) (at p3 Loc3)
         (at robot1 x1) (at robot2 x2) 
         (avail robot1) (avail robot2) 
         (avail p1) (avail p2) (avail p3) 
  )
  (:goal (and (at p1 Loc4) (at p2 Loc5) (at p3 Loc6)) 
  )
)

; plan
1. (move robot2 x2 loc3)
   deleted: (at robot2 x2)
   added: (at robot2 loc3)
   goals met: 0 of 3
2. (move robot1 x1 loc1)
   deleted: (at robot1 x1)
   added: (at robot1 loc1)
   goals met: 0 of 3
3. (load robot2 p3 loc3)
   deleted: (avail p3) (avail robot2) (at p3 loc3)
   added: (on p3 robot2)
   goals met: 0 of 3
4. (move robot2 loc3 loc6)
   deleted: (at robot2 loc3)
   added: (at robot2 loc6)
   goals met: 0 of 3
5. (load robot1 p1 loc1)
   deleted: (avail p1) (avail robot1) (at p1 loc1)
   added: (on p1 robot1)
   goals met: 0 of 3
6. (move robot1 loc1 loc4)
   deleted: (at robot1 loc1)
   added: (at robot1 loc4)
   goals met: 0 of 3
7. (unload robot2 p3 loc6)
   deleted: (on p3 robot2)
   added: (at p3 loc6) (avail robot2)
   goals met: 1 of 3
8. (move robot2 loc6 loc2)
   deleted: (at robot2 loc6)
   added: (at robot2 loc2)
   goals met: 1 of 3
9. (load robot2 p2 loc2)
   deleted: (avail p2) (avail robot2) (at p2 loc2)
   added: (on p2 robot2)
   goals met: 1 of 3
10. (move robot2 loc2 loc5)
   deleted: (at robot2 loc2)
   added: (at robot2 loc5)
   goals met: 1 of 3
11. (unload robot2 p2 loc5)
   deleted: (on p2 robot2)
   added: (at p2 loc5) (avail robot2)
   goals met: 2 of 3
12. (unload robot1 p1 loc4)
   deleted: (on p1 robot1)
   added: (at p1 loc4) (avail robot1)
   goals met: 3 of 3
